# Advanced Dataframes Lesson

In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

# the input is a dictionary...or a labeled list
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

- What does each row of data represent?
    -An individual student record of their grades and classroom
    
 - We should ask this question frequently when working with a data frame
 
 - What is the datatype of students? It is a list of strings.
 
 - Grades datatype is a numpy array

## Creating Dataframes

### From Lists and Dictionaries

In [3]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
data = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(data, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

### From Text Files & Other Handy Functions for Reading Data

- read_csv is the most common used function to obtain data from an external txt file
    - pd.read_csv("filename.csv")
    - pd.read_excel("filename.xlsx")
- read_table is also common
    - pd.read_table
- read_json works for less structured files that are still tabular
    - pd.read_json("filename.json")
- read SQL   
    - pd.read_sql
- read from clipboard
    - pd.read_clipboard()

### From SQL

In [6]:
# First SQL import:

from env import host, user, password

# connection string is being pointed at from the variable "URL"
url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    
query = """
    SELECT * FROM employees limit 10
"""

pd.read_sql(query, url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [7]:
# Another SQL import 
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 5
OFFSET 200
'''

pd.read_sql(sql, url)

   emp_no first_name       last_name
0   10513   Yuichiro        Schicker
1   10519   Yonghoan         Alencar
2   10522      Marke        Cesareni
3   10524  Shigehiro        Cincotta
4   10526    Kwangho  Theuretzbacher

In [8]:
# SQL import for all current employees and their current manager:

current_emp_info = '''
SELECT CONCAT(e.first_name, ' ', e.last_name) as emp_name, dept_name, CONCAT(managers.first_name, ' ', managers.last_name) as mgr_name
FROM employees as e
JOIN dept_emp as de using(emp_no)
JOIN departments as d using(dept_no)
JOIN dept_manager using(dept_no)
JOIN employees as managers on managers.emp_no = dept_manager.emp_no
WHERE dept_manager.to_date > now()
AND de.to_date > now()
limit 10
'''

# set this query to a variable for future use:
emp_info = pd.read_sql(current_emp_info, url)

In [9]:
emp_info

              emp_name  dept_name           mgr_name
0  Cristinel Bouloucos  Marketing  Vishwani Minakawa
1     Berhard McFarlin  Marketing  Vishwani Minakawa
2          Yucel Auria  Marketing  Vishwani Minakawa
3    Karoline Cesareni  Marketing  Vishwani Minakawa
4       Nikolaos Llado  Marketing  Vishwani Minakawa
5   Djelloul Laventhal  Marketing  Vishwani Minakawa
6  Phule Hammerschmidt  Marketing  Vishwani Minakawa
7       Hyuckchul Gini  Marketing  Vishwani Minakawa
8           Feiyu Luft  Marketing  Vishwani Minakawa
9  Candida Porotnikoff  Marketing  Vishwani Minakawa

In [10]:
type(emp_info)

pandas.core.frame.DataFrame

In [11]:
# practice selecting data from df that was imported from SQL: 

emp_info[2:]

              emp_name  dept_name           mgr_name
2          Yucel Auria  Marketing  Vishwani Minakawa
3    Karoline Cesareni  Marketing  Vishwani Minakawa
4       Nikolaos Llado  Marketing  Vishwani Minakawa
5   Djelloul Laventhal  Marketing  Vishwani Minakawa
6  Phule Hammerschmidt  Marketing  Vishwani Minakawa
7       Hyuckchul Gini  Marketing  Vishwani Minakawa
8           Feiyu Luft  Marketing  Vishwani Minakawa
9  Candida Porotnikoff  Marketing  Vishwani Minakawa

### Aggregation
- Aggregate: To put together
- Aggregation allows us to put stuff together
- This changes the dimension of our observation

In [12]:
df.head()

    name  math  english  reading classroom
0  Sally    62       85       80         A
1   Jane    88       79       67         B
2  Suzie    94       74       95         A
3  Billy    98       96       88         B
4    Ada    77       92       98         A

In [13]:
# Remember double brackets mean dataframe
# Aggregating changes what each row means

df[['english', 'reading', 'math']].agg(['mean', 'median', 'min', 'max'])
        ###Columns###                          ###rows###

          english  reading       math
mean    77.666667     86.5  84.833333
median  77.500000     89.0  90.000000
min     62.000000     67.0  62.000000
max     99.000000     98.0  98.000000

In [14]:
#show the English average:
df.english.mean()

77.66666666666667

In [15]:
# Grouping By is a type of aggregation. We group our original rows together by some column's value
# To group by:
# Step 1: Group by a column
# Step 2: Select an aggregate function
# Min math score by classroom:
df.groupby('classroom').math.min()

classroom
A    62
B    79
Name: math, dtype: int64

In [16]:
# Average math grade by classroom
df.groupby('classroom').math.mean()

classroom
A    82.625
B    89.250
Name: math, dtype: float64

In [17]:
df.groupby('classroom').math.agg(["mean", "median"])

             mean  median
classroom
A          82.625      87
B          89.250      90

In [18]:
# Get the number of students in each class: 
df.groupby("classroom").name.count()

classroom
A    8
B    4
Name: name, dtype: int64

In [19]:
df.groupby("classroom").describe()

           math                                                    english  \
          count    mean        std   min    25%   50%    75%   max   count
classroom
A           8.0  82.625  12.281665  62.0  75.00  87.0  92.25  94.0     8.0
B           4.0  89.250   7.973916  79.0  85.75  90.0  93.50  98.0     4.0

                  ...              reading                                  \
            mean  ...    75%   max   count    mean        std   min    25%
classroom         ...
A          72.75  ...  81.25  92.0     8.0  87.125   8.887190  72.0  80.75
B          87.50  ...  96.75  99.0     4.0  85.250  12.392874  67.0  82.75


            50%    75%   max
classroom
A          88.5  94.25  98.0
B          90.5  93.00  93.0

[2 rows x 24 columns]

In [20]:
df['passing_math'] = df.math >= 70
df.head()

    name  math  english  reading classroom  passing_math
0  Sally    62       85       80         A         False
1   Jane    88       79       67         B          True
2  Suzie    94       74       95         A          True
3  Billy    98       96       88         B          True
4    Ada    77       92       98         A          True

In [21]:
df.groupby(["classroom", "passing_math"]).reading.agg(["mean", "median", "min", "max"])

                             mean  median  min  max
classroom passing_math
A         False         87.000000    87.0   80   94
          True          87.166667    88.5   72   98
B         True          85.250000    90.5   67   93

In [22]:
df.groupby(["classroom", "passing_math"]).name.count()

classroom  passing_math
A          False           2
           True            6
B          True            4
Name: name, dtype: int64

In [23]:
# .transform in the way below allows us to calculate an aggregate and append that aggregate 
#onto the original dataframe
df.assign(avg_math_score_by_classroom=df.groupby('classroom').math.transform('mean'))

,name,math,english,reading,classroom,passing_math,avg_math_score_by_classroom
0,Sally,62,85,80,A,False,82.625
1,Jane,88,79,67,B,True,89.250
2,Suzie,94,74,95,A,True,82.625
3,Billy,98,96,88,B,True,89.250
4,Ada,77,92,98,A,True,82.625
5,John,79,76,93,B,True,89.250
6,Thomas,82,64,81,A,True,82.625
7,Marie,93,63,90,A,True,82.625
8,Albert,92,62,87,A,True,82.625
9,Richard,69,80,94,A,False,82.625
10,Isaac,92,99,93,B,True,89.250
11,Alan,92,62,72,A,True,82.625

In [24]:
# Another aggregation example: Count the number of employees from each department fom the employees db

sql = """
select *
from departments
join dept_emp using(dept_no)
where to_date > now()
"""

employees = pd.read_sql(sql, url)
employees.head()

  dept_no         dept_name  emp_no   from_date     to_date
0    d009  Customer Service   10038  1989-09-20  9999-01-01
1    d009  Customer Service   10049  1992-05-04  9999-01-01
2    d009  Customer Service   10060  1992-11-11  9999-01-01
3    d009  Customer Service   10088  1992-03-21  9999-01-01
4    d009  Customer Service   10112  1998-05-01  9999-01-01

In [25]:
employees.groupby(["dept_name"]).emp_no.count()

dept_name
Customer Service      17569
Development           61386
Finance               12437
Human Resources       12898
Marketing             14842
Production            53304
Quality Management    14546
Research              15441
Sales                 37701
Name: emp_no, dtype: int64

In [26]:
# Look at salaries from employees based on gender

sql = """
select *
from employees
join salaries using(emp_no)
where to_date > now()
"""

employees = pd.read_sql(sql, url)
employees.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,94692,2001-09-09,9999-01-01

In [27]:
employees.groupby(['gender']).salary.agg(['min', 'median', 'max', "std", 'count'])

          min  median     max           std   count
gender
F       38936   69764  152710  17229.518086   96010
M       38623   69830  158220  17363.387014  144114

### Merging and Joining

- We call merge off pandas which means it is a function not a method

In [28]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [29]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [30]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='left')

   id_x name_x  role_id  id_y    name_y
0     1    bob      1.0   1.0     admin
1     2    joe      2.0   2.0    author
2     3  sally      3.0   3.0  reviewer
3     4   adam      3.0   3.0  reviewer
4     5   jane      NaN   NaN       NaN
5     6   mike      NaN   NaN       NaN

In [31]:
# rename columns during the merge
pd.merge(
    users.rename(columns={'id': 'user_id', 'name': 'username'}),
    roles.rename(columns={'name': 'role_name'}),
    left_on='role_id', right_on='id', how='left')

   user_id username  role_id   id role_name
0        1      bob      1.0  1.0     admin
1        2      joe      2.0  2.0    author
2        3    sally      3.0  3.0  reviewer
3        4     adam      3.0  3.0  reviewer
4        5     jane      NaN  NaN       NaN
5        6     mike      NaN  NaN       NaN

### Reshaping Data

In [32]:
df['passing_math'] = df.math.apply(lambda n: 'passing' if n >= 70 else 'failing')

In [33]:
#Crosstab adds things up:
pd.crosstab(df.passing_math, df.classroom)

classroom     A  B
passing_math
failing       2  0
passing       6  4

In [34]:
pd.crosstab(df.passing_math, df.classroom, margins='All')
#margins sums the columns

classroom     A  B  All
passing_math
failing       2  0    2
passing       6  4   10
All           8  4   12

In [35]:
#normalize lets use see the percentages
pd.crosstab(df.passing_math, df.classroom, normalize=True)

classroom            A         B
passing_math
failing       0.166667  0.000000
passing       0.500000  0.333333

In [36]:
df.pivot_table(values='math', index='classroom', columns='passing_math', aggfunc='mean')

passing_math  failing    passing
classroom
A                65.5  88.333333
B                 NaN  89.250000